Repository: jfuentescasillas/VIP_01_Beers
Catalog: VIP_01_Beers/*.lproj/Localizable.strings
Languages: es_419, fr, it

# selectLanguageTitle
source: Select Language
es_419: Elegir Idioma
fr: Chosir Langue
it: Scegliere Lingua

# closeBtnTitle
source: Close
es_419: Cerrar
fr: Fermer
it: Chiedere

# englishLanguage
source: English
es_419: Inglés
fr: Anglais
it: Inglese

# frenchLanguage
source: French
es_419: Francés
fr: Français
it: Francese

# spanishLALanguage
source: Spanish-LA
es_419: Español-LA
fr: Espagnol-AL
it: Spagnolo-AL

# spanishLanguage
source: Spanish
es_419: Español
fr: Espagnol
it: Spagnolo

# italianLanguage
source: Italian
es_419: Italiano
it: Italiano

# beersNavItemTitle
source: Indies Beers
es_419: Cervezas Indie
fr: Bières Indie
it: Birre Indies

# beersTabBarItem
source: Beers
es_419: Cervezas
fr: Bières
it: Birre

# beersResetButtonTitle
source: Reset
es_419: Restablecer
fr: Rétablir
it: Ristabilire

# beersSearchBarPlaceholder
source: Search for a beer...
es_419: Buscar cerveza...
fr: Chercher une bière...
it: Cercare birra...

# beersSearchBarInvalidTextInputTitle
source: Invalid text input
es_419: Texto Inválido
fr: Texte Invalide
it: Testo non valido

# beersSearchBarInvalidTextInputMessage
source: Only alphanumeric characters are allowed in the search bar. Please try another search with valid characters
es_419: Solo se permiten caracteres alfanuméricos en la barra de búsqueda. Por favor reinténtalo con caracteres válidos
fr: Seuls des valeurs alphanumériques sont permis. Veuillez réessayer une autre recherche avec des caractères valides.
it: Nella barra di ricerca sono consentiti solo caratteri alfanumerici. Per favore riprova con caratteri validi

# emptyResultsLabelNoInternet
source: No internet connection. Please Try again later.
es_419: Sin conexión a internet. Por favor reinténtalo de nuevo.
fr: Pas de connexion internet. Veuillez réessayer plus tard.
it: Nessuna conessione internet. Per favore riprova più tarde.

# emptyResultsLabelNoResults
source: There were no results for the beer you requested. Please try with another name.
es_419: No hay resultados para la cerveza solicitada. Por favor inténtalo con otro nombre.
fr: Il n'y a pas des résultats pour votre recherche. Veuillez réessayer avec un autre nom de bière.
it: Non ci sono risultati per la birra richiesta. Prova con un altro nome.

# alertControllerInvalidTextInputTitle
source: Invalid Text Input
es_419: Texto Inválido
fr: Texte non valide
it: Testo non valido

# alertControllerInvalidTextInputMsg
source: Your search can only contain numbers, letters and/or blank spaces, please try again with a valid format.
es_419: La búsqueda solo puede contener números, letras y/o espacios en blanco, favor de reintentarlo con un formato válido.
fr: La recherche ne peut contenir que des lettres, des numéros et/ou des espaces en blanc. Veuillez réessayer avec un autre format valide.
it: La ricerca può contenere solo numeri, letterre e/o spazi vuoti, riprova con un formato valido.

# beerSavedSuccessfullyTitle
source: Excellent!
es_419: ¡Excelente!
fr: Fantastique!
it: Eccellente!

# beerSavedSuccessfullyMsg
source: The beer was successfully saved in your list of Favorite Beers!
es_419: ¡La cerveza se guardó con éxito en tu lista de cervezas favoritas!
fr: La bière a été enregistrée avec succès dans ta liste de bières favorites!
it: La birra è stata salvata con successo nella tua lista di birre preferite!

# beerCannotBeSavedTitle
source: Oops!
es_419: ¡Épale!
fr: Oh-la-la!
it: Mamma mia!

# beerCannotBeSavedMsg
source: This beer is already in your list of Favorite Beers! Therefore, it will not be saved again in the list.
es_419: Esta cerveza ya existe en tu lista de Cervezas Favoritas, por lo tanto, no se guardará.
fr: Cette bière se trouve déjà dans ta liste de favorites! Donc, elle n'y sera pas réenregistrée.
it: Questa birra essiste già nell'elenco delle tue Birre Preferite, quindi non verrà salvata.

# beerSavedCommentsDefaultValue
source: Write here your observations about this beer...
es_419: Escribe tus observaciones acerca de esta cerveza...
fr: Écris ici tes observations sur cette bière...
it: Scrivi le tue osservaziono su questa birra...

# favBeersNavItemTitle
source: Favorite Beers
es_419: Cervezas Favoritas
it: Birre Preferite

# favBeersTabBarItem
source: Favorites
es_419: Favoritas
it: Preferite

# searchFavBeerPlaceholder
source: Search your favorite beer...
es_419: Busca tu birra favorita...
fr: Recherche ta bière favorite...
it: Cerca la tua birra preferita...

# emptyFavoriteListTxt
source: Your list of favorite beers is currently empty! You can save a beer in this favorite list from the Beer tab! Just click on the beer you like from the list, and inside the details of that selected beer, press the "Save" button in the right upper corner of the screen to save it in favorites.
es_419: ¡Tu lista de cervezas favoritas está vacía! Guarda una desde el catálogo de cervezas en la pestaña Cerveza. Solo haz click en la cerveza que te guste de la lista y dentro de sus detalles, pulsa sobre el botón "Guardar" en la esquina superior derecha de la pantalla.
fr: ¡Ta liste de bières favorites est vide! Pour en enregistrer une, fais-le dès la fenêtre de Bières. Dans la liste de bières, click sur l'une des bières et dedans sa fenêtre de détails, appuis le bouton "Enregistrer", trouvé dans le coin supérior droit de l'écran.
it: Il tuo elenco di birre preferite è vuoto! Salvane una dal catalogo delle birre nella scheda Birra. Basta fare click sulla birra che ti piace dall'elenco e, all'interno dei suoi detagli, fare click sul pulsante "Salva" nell'angolo in alto a destra dello schermo.

# alertControllerInvalidQueryTitle
source: Invalid Query
es_419: Búsqueda Inválida
fr: Requête invalide
it: Nessuna birra trovata!

# alertControllerInvalidQueryMsg
source: Your search must not be empty. Please insert a valid value in order to search a beer in your list of favorites.
es_419: Tu búsqueda no puede estar vacía. Por favor use un valor válido para buscar una cerveza en tu lista de favoritas.
fr: Le contenu de la recherche ne peut pas être vide. Veuillez utiliser une valeur valide afin de rechercher une bière dans votre liste de bières favorites.
it: La tua ricerca non può essere vuota. Utilizza un valore valido per cercare nell'elenco delle tue birre preferite.

# noBeersFoundTitle
source: No Beers Found!
es_419: ¡No se encontraron cervezas!
fr: Aucune bière trouvée!
it: ¡No se encontraron cervezas!

# noBeersFoundMsg
source: Your favorite list of beers does not have any beer with the requested query, please try again with another name.
es_419: En tu lista de cervezas favoritas no existe una con el nombre solicitado, reinténtalo con otro nombre, por favor.
fr: Il n'y a aucune bière dans ta liste de favorites avec le nom demandé. Veuillez reéssayer avec un autre nom de bière.
it: Non c'è nessuna birra con il nome richiesto nell'elenco delle tue birre preferite. Riprova con altro nome, per favore.

# favBeerSaveObservationButtonTitle
source: Save observation
es_419: Guardar observaciones
fr: Enregistrer l'observation
it: Salva osservazioni

# alertControllerOpinionSavedTitle
source: Great!
es_419: ¡Fantástico!
fr: Merveilleux!
it: Fantastico!

# alertControllerOpinionSavedMsg
source: Your comment about this beer was successfully saved!
es_419: ¡Tus observaciones acerca de esta cerveza fueron exitosamente guardados!
fr: Ton commentaire sur cette bière a été enregistré avec succès!
it: Le tue osservazioni su questa bira sono state salvate con successo!

# okBtn
source: Ok!
es_419: ¡Entendido!
fr: Compris!
it: Capito!

# clientErrorTitle
source: Error in Request
es_419: Error En Solicitud
fr: Erreur Dans La Demande
it: Error Su Richiesta

# clientErrorMsg
source: There was an error in the request of information. Please try again later.
es_419: Hubo un error al pedir información. Intenta más tarde.
fr: Une erreur s'est produite lors de la demande des données. Veuillez réessayer plus tard.
it: Si è verificato un errore durante la richiesta d'informazione. Riprova più tarde.

# serverErrorTitle
source: Error in Reception
es_419: Error en Recepción
fr: Erreur De Réception
it: Error di Ricezione

# serverErrorMsg
source: There was an error from the server, no information received. Please try again later.
es_419: Hubo un error desde el servidor, no pudo recibirse información. Intenta más tarde.
fr: Une erreur s'est produite au niveau du serveur. Aucune information reçue. Veuillez réessayer plus tard.
it: Si è verificato un errore dal server, non è stato possibile ricevere informazione. Riprova più tarde.

# alertControllerNoInternetTitle
source: No Internet Connection
es_419: Sin Conexión a Internet
fr: Pas de connexion internet
it: Nessuna conessione internet

# alertControllerNoInternetMsg
source: It seems that your device has no internet connection, please try again later.
es_419: Parece que tu dispositivo no tiene internet. Reinténtalo más tarde por favor.
fr: Il semble que votre dispositif n'a pas de connexion internet. Veuillez réesayer plus tard.
it: Sembra che il tuo dispositivo non abbia internet. Riprova più tarde per favore.

source: Unknown Error
es_419: Error desconocido
fr: Erreur inconnue
it: Errore sconociuto

source: Unknown Response
es_419: Respuesta desconocida
fr: Réponse inconnue
it: Risposta sconociuta

# noInternetError
source: Device With No Internet Connection
es_419: Teléfono sin conexión a internet
fr: Téléphone sans connexion internet
it: Telefono senza internet

# badUrlError
source: Invalid API URL. Please provide a valid URL
es_419: API URL inválida. Dé una dirección URL válida
fr: Invalide API URL. Veuillez donner une URL valide.
it: URL non valida. Deve dare una direzione URL valida

source: Generic error
es_419: Error genérico
fr: Erreur générique
it: Errore generico
